bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/image_sensor.c
/** @defgroup  IMAGE_SENSOR_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  CAMERA GPIO Initialization
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
static void CAM_GPIO_Init(void)
{
    GLB_GPIO_Cfg_Type cfg;
    GLB_GPIO_Type gpioPins[] = {GLB_GPIO_PIN_16,GLB_GPIO_PIN_17,GLB_GPIO_PIN_18,GLB_GPIO_PIN_19,GLB_GPIO_PIN_24,GLB_GPIO_PIN_25,
                                GLB_GPIO_PIN_26,GLB_GPIO_PIN_27,GLB_GPIO_PIN_28,GLB_GPIO_PIN_29,GLB_GPIO_PIN_30,GLB_GPIO_PIN_31,
                                GLB_GPIO_PIN_32};

    GLB_GPIO_Func_Init(GPIO_FUN_CAM,gpioPins,sizeof(gpioPins)/sizeof(gpioPins[0]));

    // REFCLK
    cfg.gpioPin=GLB_GPIO_PIN_33;
    cfg.gpioFun=GPIO_FUN_CLOCK_OUT;
    GLB_GPIO_Init(&cfg);

    cfg.gpioMode=GPIO_MODE_OUTPUT;
    cfg.pullType=GPIO_PULL_UP;
    // PWDN
    cfg.gpioPin=GLB_GPIO_PIN_8;
    cfg.gpioFun=GPIO_FUN_GPIO;
    GLB_GPIO_Init(&cfg);
    GLB_GPIO_Write(GLB_GPIO_PIN_8, 1);
    GLB_GPIO_Output_Enable(GLB_GPIO_PIN_8);

    // RESETB
    cfg.gpioPin=GLB_GPIO_PIN_20;
    cfg.gpioFun=GPIO_FUN_GPIO;
    GLB_GPIO_Init(&cfg);
    GLB_GPIO_Write(GLB_GPIO_PIN_20, 1);
    GLB_GPIO_Output_Enable(GLB_GPIO_PIN_20);

    //GLB_Set_ClkOutSel(1, 0); // select dvp_ref_clk pin as cam_ref_clk
    GLB_Set_CAM_CLK(1, 1, 3); // select cam_ref_clk as 96M / 4 = 24M
}

/****************************************************************************/ /**
 * @brief  Dump image sensor register while is set
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_Dump_Register(void)
{
    uint32_t i;

    for (i = 0; i < sizeof(sensorRegList) / sizeof(sensorRegList[0]); i++) {
        MSG("reg[%02x]: %02x\n", sensorRegList[i][0], CAM_Read_Byte8(sensorRegList[i][0]));
    }
}

/****************************************************************************/ /**
 * @brief  I2C GPIO Initialization
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
static void I2C_GPIO_Init(void)
{
    GLB_GPIO_Type gpioPins[] = {GLB_GPIO_PIN_22,GLB_GPIO_PIN_23};

    GLB_GPIO_Func_Init(GPIO_FUN_I2C2,gpioPins,sizeof(gpioPins)/sizeof(gpioPins[0]));
}

/****************************************************************************/ /**
 * @brief  I2C CAMERA Write 8 bits
 *
 * @param  cmd: Reg Addr
 * @param  data: Reg Value
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
static BL_Err_Type CAM_Write_Byte8(uint8_t cmd, uint8_t data)
{
    uint8_t temp = data;
    I2C_Transfer_Cfg tranCfg;

    tranCfg.slaveAddr = I2C_CAMERA_ADDR;
    tranCfg.slaveAddr10Bit = DISABLE;
    tranCfg.stopEveryByte = DISABLE;
    tranCfg.subAddrSize = 1;
    tranCfg.subAddr = cmd;
    tranCfg.dataSize = 1;
    tranCfg.data = &temp;
    return I2C_MasterSendBlocking(I2C0_MM_ID, &tranCfg);
}

/****************************************************************************/ /**
 * @brief  I2C CAMERA Read 8 bits
 *
 * @param  cmd: Reg Addr
 *
 * @return Reg Value
 *
*******************************************************************************/
static uint8_t CAM_Read_Byte8(uint8_t cmd)
{
    uint8_t temp = 0;
    I2C_Transfer_Cfg tranCfg;

    tranCfg.slaveAddr = I2C_CAMERA_ADDR;
    tranCfg.slaveAddr10Bit = DISABLE;
    tranCfg.stopEveryByte = DISABLE;
    tranCfg.subAddrSize = 1;
    tranCfg.subAddr = cmd;
    tranCfg.dataSize = 1;
    tranCfg.data = &temp;
    I2C_MasterReceiveBlocking(I2C0_MM_ID, &tranCfg);

    return temp;
}

/****************************************************************************/ /**
 * @brief  CAMERA Read ID
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
static BL_Err_Type CAM_Read_ID(void)
{
    uint8_t buf[2] = { 0 };
#if (IMAGE_SENSOR_USE == IMAGE_SENSOR_BF2013 || IMAGE_SENSOR_USE == IMAGE_SENSOR_GC2053)

    buf[0] = CAM_Read_Byte8(SENSOR_ID_REG_MSB);
    bflb_platform_delay_ms(10);

    buf[1] = CAM_Read_Byte8(SENSOR_ID_REG_LSB);

    if (buf[0] == SENSOR_ID_VAL_MSB && buf[1] == SENSOR_ID_VAL_LSB) {
        MSG("ID correct\n");
        return SUCCESS;
    } else {
        MSG("%02x %02x\n", buf[0], buf[1]);
        return ERROR;
    }

#elif (IMAGE_SENSOR_USE == IMAGE_SENSOR_GC0308)
    buf[0] = CAM_Read_Byte8(SENSOR_ID_REG);

    if (buf[0] == SENSOR_ID_VAL) {
        return SUCCESS;
    } else {
        return ERROR;
    }

#endif
}

/****************************************************************************/ /**
 * @brief  CAMERA Reg Config
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
static BL_Err_Type CAM_Reg_Config(void)
{
    int i;

    for (i = 0; i < sizeof(sensorRegList) / sizeof(sensorRegList[0]); i++) {
        if (CAM_Write_Byte8(sensorRegList[i][0], sensorRegList[i][1]) != SUCCESS) {
            return ERROR;
        }

        bflb_platform_delay_ms(1);
    }

    return SUCCESS;
}

/*@} end of group IMAGE_SENSOR_Private_Functions */

/** @defgroup  IMAGE_SENSOR_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Image sensor initialization
 *
 * @param  camId: DVP2BUS ID
 * @param  mjpegEn: Enable or disable mjpeg
 * @param  camCfg: CAM configuration structure pointer
 * @param  mjpegCfg: MJPEG configuration structure pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Image_Sensor_Init(CAM_ID_Type camId, BL_Fun_Type mjpegEn, CAM_CFG_Type *camCfg, MJPEG_CFG_Type *mjpegCfg)
{
    /* Gpio init */
    CAM_GPIO_Init();
    I2C_GPIO_Init();

    bflb_platform_delay_ms(1);

    if (CAM_Read_ID() != SUCCESS) {
        return ERROR;
    }

