bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/image_sensor.c
    if (CAM_Reg_Config() != SUCCESS) {
        return ERROR;
    }

    CAM_Disable(camId);
    MJPEG_Disable();

    if (mjpegEn) {
        CAM_Init(camId, camCfg);
        MJPEG_Init(mjpegCfg);
        MJPEG_Enable();
    } else {
        CAM_Init(camId, camCfg);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get one camera frame
 *
 * @param  camId: DVP2BUS ID
 * @param  pic: Pointer of picture start address
 * @param  len: Length of picture
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Image_Sensor_CAM_Get(CAM_ID_Type camId, uint8_t **pic, uint32_t *len)
{
    CAM_Frame_Info info;
    ARCH_MemSet(&info, 0, sizeof(info));

    CAM_Get_Frame_Info(camId, &info);

    if (info.validFrames == 0) {
        return ERROR;
    }

    *pic = (uint8_t *)(uintptr_t)(info.curFrameAddr);
    *len = info.curFrameBytes;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get available count of camera frames
 *
 * @param  camId: DVP2BUS ID
 *
 * @return Frames count
 *
*******************************************************************************/
uint8_t Image_Sensor_CAM_Frame_Count(CAM_ID_Type camId)
{
    return CAM_Get_Frame_Count(camId);
}

/****************************************************************************/ /**
 * @brief  Pop one camera frame
 *
 * @param  camId: DVP2BUS ID
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_CAM_Release(CAM_ID_Type camId)
{
    CAM_Pop_Frame(camId);
}

/****************************************************************************/ /**
 * @brief  Open camera function
 *
 * @param  camId: DVP2BUS ID
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_CAM_Open(CAM_ID_Type camId)
{
    CAM_Enable(camId);
}

/****************************************************************************/ /**
 * @brief  Close camera function
 *
 * @param  camId: DVP2BUS ID
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_CAM_Close(CAM_ID_Type camId)
{
    CAM_Disable(camId);
}

/****************************************************************************/ /**
 * @brief  Deinit camera module
 *
 * @param  camId: DVP2BUS ID
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_CAM_Deinit(CAM_ID_Type camId)
{
    CAM_Deinit(camId);
}

/****************************************************************************/ /**
 * @brief  Get one mjpeg frame
 *
 * @param  pic: Pointer of picture start address
 * @param  len: Length of picture
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Image_Sensor_MJPEG_Get(uint8_t **pic, uint32_t *len)
{
    MJPEG_Frame_Info info;
    ARCH_MemSet(&info, 0, sizeof(info));

    MJPEG_Get_Frame_Info(&info);

    if (info.validFrames == 0) {
        return ERROR;
    }

    *pic = (uint8_t *)(uintptr_t)(info.curFrameAddr);
    *len = info.curFrameBytes;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get available count of mjpeg frames
 *
 * @param  None
 *
 * @return Frames count
 *
*******************************************************************************/
uint8_t Image_Sensor_MJPEG_Frame_Count(void)
{
    return MJPEG_Get_Frame_Count();
}

/****************************************************************************/ /**
 * @brief  Pop one mjpeg frame
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_MJPEG_Release(void)
{
    MJPEG_Pop_Frame();
}

/****************************************************************************/ /**
 * @brief  Open mjpeg function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_MJPEG_Open(void)
{
    MJPEG_Enable();
}

/****************************************************************************/ /**
 * @brief  Close mjpeg function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_MJPEG_Close(void)
{
    MJPEG_Disable();
}

/****************************************************************************/ /**
 * @brief  Deinit mjpeg module
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Image_Sensor_MJPEG_Deinit(void)
{
    MJPEG_Deinit();
}

/*@} end of group IMAGE_SENSOR_Public_Functions */

/*@} end of group IMAGE_SENSOR */

/*@} end of group Image_Sensor_Driver */
